УТ_для_edt.РасширениеСмарт/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РеализацияТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ЗаказКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПереходаПраваСобственности</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>РеализацияПоЗаказам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресДоставкиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КартаЛояльности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВернутьМногооборотнуюТару</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаВозвратаМногооборотнойТары</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ТребуетсяЗалогЗаТару</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВариантОформленияПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПропускнаяСистема</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяОбработкаГрузаТранспортнойКомпанией</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СпособДоставкиТовара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПлатильщикЗаДоставкуГруза</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаличиеСчетаВБухгалтерии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартТелефонКонтактногоЛица</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8d330630-6a27-4998-be43-aa39ac6f1851">
    <name>СуммаВзаиморасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f5ab67a3-dc54-4499-b33a-4b005b14779b">
    <name>смартБезвозмезднаяПередача</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c2f28df9-91fb-458d-9c3c-6c1b016f7007">
    <name>ВариантВыбытияМаркируемойПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НоменклатураНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ХарактеристикаНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КодТНВЭД</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПроцентАвтоматическойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаАвтоматическойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПроцентРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СрокПоставки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЗаказКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/КалендарныеГрафики/КалендарныеГрафики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="17aadd5f-cda2-4785-a07f-3ab4b04434a6">
  <name>КалендарныеГрафики</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="71bc35e6-0fec-4e54-af2d-23d1357d1c3b">
    <name>ДеньВключенВГрафик</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="d5df31c3-89f9-469c-80a9-fb4706d30bc4">
    <name>ДатаГрафика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/ДополнительныеСведения/ДополнительныеСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3ad5d8a7-3071-46aa-aebf-306bdb67983b">
  <name>ДополнительныеСведения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ab7ef662-71c1-4d51-9f0f-ea8c5ea3df8a">
    <name>Значение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="cb954476-c551-4a06-9bcd-18d67ba47dc8">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="79201015-bfae-463e-81f1-0ae2d3066f3f">
    <name>Свойство</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/СостоянияЗаказовКлиентов/СостоянияЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СостоянияЗаказовКлиентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ДатаСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes>
    <name>СуммаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДолга</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроцентОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПроцентОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПроцентДолга</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЕстьРасхожденияОрдерНакладная</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/Documents/РеализацияТоваровУслуг/Forms/ФормаДокумента/Module.bsl
#Область ПеренесеноСДоработками

&НаСервере
&После("ПриЧтенииСозданииНаСервере")
Процедура смарт_ПриЧтенииСозданииНаСервере()
	// Фролов+
	Если ЗначениеЗаполнено(Объект.КонтактноеЛицо) Тогда 
		ОбновитьТелефоныКонтактногоЛица();
	КонецЕсли;
	ЭтаФорма.Элементы.НаличиеСчетаВБухгалтерии.ТолькоПросмотр = ?(ДоступноНаличиеСчетаВБухгалтерии(), Ложь, Истина);

	Элементы.смартПерезаполнитьДоставку.Видимость=РольДоступна("ПолныеПрава") Или РольДоступна("ДобавлениеИзменениеЗаданийНаПеревозку");
	
	ЗаполнитьДоставкуСервер();
	
	смартПодписан=смартСервер.ПолучитьДанныеПодписаногоДокумента(Объект.Ссылка,"Подписан");
	смартОтветственныйЗаПодпись=смартСервер.ПолучитьДанныеПодписаногоДокумента(Объект.Ссылка,"ПодписавшийДокумент");
	смартСчетФактура=УчетНДСРФВызовСервера.СчетФактураВыданныйПоОснованию(Объект.Ссылка,Объект.Организация);
	смартИмяФайла=смартСервер.ПолучитьИмяФайлаДляБуфераОбмена(Объект.ЗаказКлиента,смартСчетФактура);

	Попытка
		
		//++ #Б-4672 смарт: Фролов 15.10.2025 //Контроль возврата УПД с подписью клиента
		МассивРеквизитов = Новый Массив;
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартПодписанаТН", Новый ОписаниеТипов("Булево")));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартОтветственныйЗаПодписаниеТН", Новый ОписаниеТипов("СправочникСсылка.Пользователи")));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартИмяФайлаТН", Новый ОписаниеТипов("Строка")));
		//++ #Б5372 смарт: Шляпников 20.01.2026 / Доработать механизм контроля подписания УПД
		МассивРеквизитов.Добавить(Новый РеквизитФормы("смартРаботаПоДокументамПроведена", Новый ОписаниеТипов("Булево")));
		//-- #Б5372 смарт: Шляпников 20.01.2026
		
		ИзменитьРеквизиты(МассивРеквизитов);
		
	Исключение
	КонецПопытки;
	
	ЭтаФорма.смартИмяФайлаТН = смартСервер.ПолучитьИмяФайлаТНДляБуфераОбмена(Объект.ЗаказКлиента, смартСчетФактура);
	ЭтаФорма.смартПодписанаТН = смартСервер.ПолучитьДанныеПодписаногоДокумента(Объект.Ссылка, "ПодписанаТН");
	ЭтаФорма.смартОтветственныйЗаПодписаниеТН = смартСервер.ПолучитьДанныеПодписаногоДокумента(Объект.Ссылка, "ОтветственныйЗаПодписаниеТН");
	//++ #Б5372 смарт: Шляпников 20.01.2026 / Доработать механизм контроля подписания УПД
	ЭтаФорма.смартРаботаПоДокументамПроведена = смартСервер.ПолучитьДанныеПодписаногоДокумента(Объект.Ссылка, "смартРаботаПоДокументамПроведена");
	//-- #Б5372 смарт: Шляпников 20.01.2026
	
	Попытка
		
		НовыйГруппа = Элементы.Вставить("смартГруппаПодпиьДокументаТН", Тип("ГруппаФормы"), 
			ЭтаФорма, Элементы.ГруппаСчетФактураИСостояние);
		НовыйГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НовыйГруппа.ОтображатьЗаголовок = Ложь;
		НовыйГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		НовыйЭлемент = Элементы.Добавить("смартПодписанаТН", Тип("ПолеФормы"), Элементы.смартГруппаПодпиьДокументаТН); 	
		НовыйЭлемент.Вид 						= ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПутьКДанным 				= "смартПодписанаТН";
		НовыйЭлемент.Заголовок 					= "ТН подписана";
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "смартПодписанаТНПриИзменении");
		
		//++ #Б5372 смарт: Шляпников 20.01.2026 / Доработать механизм контроля подписания УПД
		События = Новый Структура;
		События.Вставить("ПриИзменении", "смартРаботаПоДокументамПроведенаПриИзменении");
		
		смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартРаботаПоДокументамПроведена", ЭтаФорма, "Работа по документам проведена", 2, "смартРаботаПоДокументамПроведена",, События, "ГруппаСчетФактураИСостояние");
		Элементы.смартРаботаПоДокументамПроведена.ТолькоПросмотр = НЕ Пользователи.РолиДоступны("смартУстановкаПодтвержденияПолученияПодписанныхДокументов");
		//-- #Б5372 смарт: Шляпников 20.01.2026

		НовыйГруппа = Элементы.Добавить("смартГруппаПодпиьДокументаТНПодписан", Тип("ГруппаФормы"), Элементы.смартГруппаПодпиьДокументаТН);
		НовыйГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НовыйГруппа.ОтображатьЗаголовок = Ложь;
		НовыйГруппа.Видимость = ?(ЭтаФорма.смартПодписанаТН = Неопределено, Ложь, ЭтаФорма.смартПодписанаТН);
		НовыйГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		НовыйЭлемент = Элементы.Добавить("смартОтветственныйЗаПодписаниеТН", Тип("ПолеФормы"), Элементы.смартГруппаПодпиьДокументаТНПодписан); 	
		НовыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным 				= "смартОтветственныйЗаПодписаниеТН";
		НовыйЭлемент.Заголовок 					= "Ответственный за подпись";
		
		НовыйЭлемент = Элементы.Добавить("смартИмяФайлаТН", Тип("ПолеФормы"), Элементы.смартГруппаПодпиьДокументаТНПодписан); 	
		НовыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным 				= "смартИмяФайлаТН";
		НовыйЭлемент.Заголовок 					= "Имя файла";
		
		СкопироватьТНКоманда = Команды.Добавить("смартСкопироватьТН");
		СкопироватьТНКоманда.Действие = "смартСкопироватьТН";
		СкопироватьТНКоманда.Отображение = ОтображениеКнопки.КартинкаИТекст;
		КнопкаСкопироватьТН = Элементы.Добавить("смартСкопироватьТН", Тип("КнопкаФормы"), Элементы.смартГруппаПодпиьДокументаТНПодписан);
		КнопкаСкопироватьТН.ИмяКоманды = "смартСкопироватьТН";
		КнопкаСкопироватьТН.Заголовок = "Скопировать";
		КнопкаСкопироватьТН.Картинка = БиблиотекаКартинок.КопированиеСтрок;
		
	Исключение
	КонецПопытки;
	
	Элементы.Подписан.ТолькоПросмотр = НЕ Пользователи.РолиДоступны("смартУстановкаПодтвержденияПолученияПодписанныхДокументов");
	Элементы.смартПодписанаТН.ТолькоПросмотр = НЕ Пользователи.РолиДоступны("смартУстановкаПодтвержденияПолученияПодписанныхДокументов");
	Элементы.смартГруппаПодпиьДокументаТНПодписан.ТолькоПросмотр = НЕ Пользователи.РолиДоступны("смартУстановкаПодтвержденияПолученияПодписанныхДокументов");
	Элементы.ГруппаПодписьДокументаДоп.ТолькоПросмотр = НЕ Пользователи.РолиДоступны("смартУстановкаПодтвержденияПолученияПодписанныхДокументов");
	//-- #Б-4672 смарт: Фролов 15.10.2025
	
	УстановитьВидимостьПодписиДокумента();
	// Фролов -
	
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 26.02.2020 14:03:42
	ЕстьУслуга=Ложь;
	Для Каждого Стр из Объект.Товары Цикл
		Если Стр.Номенклатура.ТипНоменклатуры=Перечисления.ТипыНоменклатуры.Услуга тогда
		ЕстьУслуга=Истина;	
		КонецЕсли;
	КонецЦикла;
	
	Попытка
		
		Если (РольДоступна("ПолныеПрава") Или РольДоступна("ДобавлениеИзменениеРеализацийТоваровУслуг")) 
			И (НачалоДня(Объект.Дата)=НачалоДня(ТекущаяДата()) ИЛИ Объект.Дата=Дата('00010101000000'))
			И  ЕстьУслуга тогда
			смартДобавитьКоммандуНаФорму();	
		КонецЕсли;
		
	Исключение
	КонецПопытки;
	//Смарт }Подкин Алексей Иванович 26.02.2020 14:03:42

	//++ смарт:ММ #066 336 02.09.2020 - Доработка изменения поля "Документ подписан" в Реализации
	Если НЕ УправлениеДоступом.ЕстьРоль("ПолныеПрава") Тогда
		
		Элементы.смартОтветственныйЗаПодпись.ТолькоПросмотр = Истина;
		
		//++ #Б-4672 смарт: Фролов 21.10.2025 //Контроль возврата УПД с подписью клиента
		Элементы.смартОтветственныйЗаПодписаниеТН.ТолькоПросмотр = Истина;
		//-- #Б-4672 смарт: Фролов 21.10.2025
		
	КонецЕсли;
	//-- смарт:ММ 02.09.2020
	
	Попытка
		
		//++ смарт:ММ #080 359 04.11.2020 - Перенос даты на завтра
		Если Элементы.Найти("смартПроектУПД") = Неопределено Тогда
			
			ДобавляемыеРеквизиты	= Новый Массив;
			Реквизит_смартПроектУПД = Новый РеквизитФормы("смартПроектУПД",	Новый ОписаниеТипов("Булево"),,"Перенести дату на следующий день");		
			ДобавляемыеРеквизиты.Добавить(Реквизит_смартПроектУПД);
			ИзменитьРеквизиты(ДобавляемыеРеквизиты);
			
			НовыйЭлемент = Элементы.Вставить("смартПроектУПД", Тип("ПолеФормы"), Элементы.СтраницаЗаказ, Элементы.Группа2);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
			НовыйЭлемент.ПутьКДанным = "смартПроектУПД";
			НовыйЭлемент.Подсказка = "Установить дату = следующий рабочий день";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "смартПроектУПДПриИзмененеии");

		КонецЕсли;
		
	Исключение
	КонецПопытки;
	//-- смарт:ММ 04.11.2020
	
	//++ смарт:ММ #097 460 01.03.2021 Безвозмездная передача
	//НовыйЭлемент = Элементы.Вставить("смартБезвозмезднаяПередача", Тип("ПолеФормы"), Элементы.ГруппаШапкаЛево, Элементы.ГруппаСоглашение);
    //НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
    //НовыйЭлемент.ПутьКДанным = "Объект.смартБезвозмезднаяПередача";
	//НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	//-- смарт:ММ 01.03.2021
	
	//++ смарт:КМД #3_3 461 04.03.2021
	//11.03.2021
	//выводим информационную надпись без возможности редактирования
	Попытка
		
		Если Объект.смартБезвозмезднаяПередача = Истина тогда
			НовыйЭлемент = Элементы.Вставить("смартБезвозмезднаяПередачаДекорация", Тип("ДекорацияФормы"), Элементы.ГруппаОсновное, Элементы.Комментарий);
			НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
			НовыйЭлемент.Заголовок = "Это документ безвозмездной передачи товаров";
			НовыйЭлемент.ЦветТекста = WebЦвета.ОранжевоКрасный;
			НовыйЭлемент.Шрифт = Новый Шрифт(НовыйЭлемент.Шрифт,,,Истина);
		КонецЕсли;
		//-- смарт:КМД #3_3 461 04.03.2021
		
		//++ #Б3960 смарт: Шляпников 16.09.2025 / Добавление признака VIP клиента во все документы и в карточку партнера
		смартОбщегоНазначения.СоздатьЭлементыПризнакаVIPКлиента(ЭтаФорма, Истина, "ПартнерБезКЛ");
		смартСервер.УстановитьОтображениеПризнакаВИП(ЭтаФорма, Объект.Партнер);
		//-- #Б3960 смарт: Шляпников 16.09.2025
		
		//++ #Б5878 смарт: Шляпников 27.02.2026 / Маркировка радиоэлектронной продукции. Тестирование основного сценария. Выявление ошибок.
		смартМаркировка.ДобавитьВТабличнуюЧастьКолонкиМаркировки(ЭтаФорма);
		
		Если смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("КонтроллироватьОтгрузкуМаркированнойПродукции", Ложь) Тогда
			
			Если Пользователи.РолиДоступны("смартДобавлениеИзменениеКодовМаркировкиВДокументеРеализация") Тогда
				
				смартФормированиеИнтерфейса.СоздатьКоманду(ЭтаФорма, "смартПодборШтрихкодовМаркировки", "Подобрать маркировку", "смартПодборШтрихкодовМаркировки");
				смартФормированиеИнтерфейса.СздКнопка(ЭтаФорма, "смартПодборШтрихкодовМаркировки", "ТоварыКоманднаяПанель",, "смартПодборШтрихкодовМаркировки", 1,, "ТоварыСоставНабора");
				
			КонецЕсли;
			
			смартМаркировка.УстановитьОтметкуОПодобранныхШтрихкодахВДокументе(ЭтаФорма);
			
		КонецЕсли;
		//-- #Б5878 смарт: Шляпников 27.02.2026
		
	Исключение
	КонецПопытки;

КонецПроцедуры

//++ смарт:ММ #080 359 04.11.2020 - Перенос даты на завтра
&НаКлиенте
Процедура смартПроектУПДПриИзмененеии(Элемент)
	
	Если ЭтаФорма.смартПроектУПД Тогда
		СледующийРабочийДень = смартПолучитьСледующийРабочийДень(ТекущаяДата());
		Если ЗначениеЗаполнено(СледующийРабочийДень) Тогда
			Объект.Дата = СледующийРабочийДень;
		КонецЕсли;
	Иначе
		Объект.Дата = ТекущаяДата();
	КонецЕсли;
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры //-- смарт:ММ 04.11.2020

//++ смарт:ММ #080 359 04.11.2020 - Перенос даты на следующий рабочий день
&НаСервереБезКонтекста
Функция смартПолучитьСледующийРабочийДень(ТекДата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КалендарныеГрафики.ДеньВключенВГрафик КАК ДеньВключенВГрафик,
	|	МИНИМУМ(КалендарныеГрафики.ДатаГрафика) КАК ДатаГрафика
	|ИЗ
	|	РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
	|ГДЕ
	|	КалендарныеГрафики.ДатаГрафика > &ТекДата
	|	И КалендарныеГрафики.ДеньВключенВГрафик
	|
	|СГРУППИРОВАТЬ ПО
	|	КалендарныеГрафики.ДеньВключенВГрафик";
	
	Запрос.УстановитьПараметр("ТекДата", ТекДата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен регистр сведений ""Календарные графики""");
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ДатаГрафика;
	
КонецФункции //-- смарт:ММ 04.11.2020

&НаКлиенте
Процедура смарт_КонтактноеЛицоПриИзмененииПосле(Элемент)
	ОбновитьТелефоныКонтактногоЛица();
КонецПроцедуры

&НаКлиенте
Процедура смарт_ПриОткрытииПосле(Отказ)
	
	Если Объект.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.Самовывоз") Тогда
		ЭтаФорма.Элементы.ГруппаШапкаДопПраво.Видимость = Ложь;
	Иначе
		ПереименоватьСтатусыДоставки(ПолучитьСтатусДоставки());
		ЭтаФорма.Элементы.ГруппаШапкаДопПраво.Видимость = Истина;
	КонецЕсли;
	
	//++ смарт:КМД #2_2 461 23.03.2021
	Если ТипЗнч(ЭтаФорма.ВладелецФормы) = Тип("ФормаКлиентскогоПриложения") 
		И СтрНайти(ЭтаФорма.ВладелецФормы.ИмяФормы, "КОформлениюНакладных") > 0 тогда
		//создание с помощью обработки Накладные к оформлению
		ПодключитьОбработчикОжидания("смарт_ПроверитьПраваСозданиеБезвозмезднойПередачи", 3, Истина);
	Иначе
		смарт_ПроверитьПраваСозданиеБезвозмезднойПередачи();
	КонецЕсли;
	
	//-- смарт:КМД #2_2 461 23.03.2021
	
КонецПроцедуры

&НаКлиенте
Процедура смарт_АдресДоставкиПолучателяОчисткаПосле(Элемент, СтандартнаяОбработка)
	ОбновитьСведенияПоДоставке();
КонецПроцедуры

&НаКлиенте
Процедура смарт_АдресДоставкиПолучателя2ОчисткаПосле(Элемент, СтандартнаяОбработка)
	ОбновитьСведенияПоДоставке();
КонецПроцедуры

&НаКлиенте
&Перед("ТоварыВыбор")
Процедура смарт_ТоварыВыборПеред(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//++#1547 смарт: Лопато 22.03.2024 //Автоматическое заполнение серий чернил в заказах
	смартОбщегоНазначенияКлиент.смартПроверитьУстановитьДоступностьТоварыСерия(Элемент, Элементы.ТоварыСерия, Элементы.Товары.ТекущиеДанные);
	//--#1547 смарт: Лопато 22.03.2024
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПартнерПриИзменении")
Процедура смарт_ПартнерПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено (Объект.Партнер) Тогда
		ДоставкаТоваровКлиентСервер.ОчиститьРеквизитыДоставки(Элементы,Объект);
		УстановитьВидимостьЗапретаОтгрузкиПартнеру();
		Возврат;
	КонецЕсли;

	ПриИзмененииПартнераСервер();

	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);

	Если ИспользоватьСоглашенияСКлиентами И ЗначениеЗаполнено(Объект.Соглашение) Тогда
		ПродажиКлиент.ОповеститьОбОкончанииЗаполненияУсловийПродажПоУмолчанию();
	КонецЕсли;

	// СтандартныеПодсистемы.РаботаСКонтрагентами
	ПроверкаКонтрагентовКлиент.ЗапуститьПроверкуКонтрагентовВДокументе(ЭтотОбъект, Элемент);
	// Конец СтандартныеПодсистемы.РаботаСКонтрагентами

	#Вставка
	//++ #Б3960 смарт: Шляпников 16.09.2025 / Добавление признака VIP клиента во все документы и в карточку партнера
	смартОбщегоНазначенияКлиент.УстановитьОтображениеПризнакаВИП(ЭтаФорма, Объект.Партнер);
	//-- #Б3960 смарт: Шляпников 16.09.2025
	#КонецВставки
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ТоварыНоменклатураПриИзменении")
Процедура смарт_ТоварыНоменклатураПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТекущаяСтрока", ТекущаяСтрока);
	ВопросПользователюПриИзмененииРеквизитаСтроки(
	Новый ОписаниеОповещения("ТоварыНоменклатураПриИзмененииВопросПользователюЗавершение", ЭтотОбъект, ДополнительныеПараметры),
	ТекущаяСтрока);
	
	#Вставка
	//++ #Б5878 смарт: Шляпников 27.02.2026 / Маркировка радиоэлектронной продукции. Тестирование основного сценария. Выявление ошибок.
	УстановитьОтметкуОПодобранныхШтрихкодахВДокументе();
	//-- #Б5878 смарт: Шляпников 27.02.2026
	#КонецВставки

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ТоварыКоличествоУпаковокПриИзменении")
Процедура смарт_ТоварыКоличествоУпаковокПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;

	СтруктураДействий = Новый Структура;
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, Объект);

	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	ПродажиКлиентСервер.РассчитатьИтоговыеПоказателиРеализации(ЭтаФорма);
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);

	#Вставка
	//++ #Б5878 смарт: Шляпников 27.02.2026 / Маркировка радиоэлектронной продукции. Тестирование основного сценария. Выявление ошибок.
	УстановитьОтметкуОПодобранныхШтрихкодахВДокументе();
	//-- #Б5878 смарт: Шляпников 27.02.2026
	#КонецВставки
	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПослеЗаписиНаСервере")
Процедура смарт_ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	ОбновитьОтклоненияОтЗаказа();
	ОбновитьСостояниеСервер();
	ОбновитьСостояниеЭлементовУправленияИтоговПоРасчетам();
	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
	ИзменитьЗаголовкиПоВариантуОформленияПродажи();
	МногооборотнаяТараСервер.ОбновитьПризнакБезВозвратнойТары(Объект.Товары, Объект.ВернутьМногооборотнуюТару);
	ОбщегоНазначенияУТ.ЗаполнитьДубликатыЗависимыхРеквизитовВКоллекции(Объект.Товары, ЗависимыеРеквизиты());
	ПересчитатьСуммуСверхЗаказа();
	ПродажиКлиентСервер.РассчитатьИтоговыеПоказателиРеализации(ЭтаФорма);
	ОбновитьОбязательностьСкладаВТЧ();
	УстановитьДоступностьЭлементовПоСтатусуСервер();
	ОбновитьТекстСчетаФактурыВыданные();

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.ДекорацияСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;

	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

	Если ПолучитьФункциональнуюОпцию("ИспользоватьТТН") Тогда
		Документы.ТранспортнаяНакладная.СравнитьРеквизитыТОРГ12ПослеЗаписи(ЭтаФорма);
	КонецЕсли;
	ТекущийСпособДоставки = ТекущийОбъект.СпособДоставки;

	// СтандартныеПодсистемы.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.РаботаСКонтрагентами

	СформироватьНадписьВалюты(ЭтаФорма);

	СобытияФорм.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);

	#Вставка
	//++ #Б5878 смарт: Шляпников 27.02.2026 / Маркировка радиоэлектронной продукции. Тестирование основного сценария. Выявление ошибок.
	УстановитьОтметкуОПодобранныхШтрихкодахВДокументе();
	//-- #Б5878 смарт: Шляпников 27.02.2026 
	
	//++ #6602 смарт: Тимофеева 23.04.2026 / Маркировка радиоэлектронной продукции. Системные уведомления пользователей. 
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение 
		И смартМаркировка.КонтроллироватьОтгрузкуМаркированнойПродукции(Объект.Дата) Тогда  
		
		ТаблицаМаркируемыйТовар = смартМаркировка.ПолучитьМаркируемыйТоварИзКоллекции(Объект.Товары.Выгрузить(), Объект.Дата);
		Если ТаблицаМаркируемыйТовар.Количество() > 0 Тогда  
			МаркируемыйТоварМассив = Новый Массив;			
			Для Каждого СтрокаТаблицы Из ТаблицаМаркируемыйТовар Цикл 
				Если МаркируемыйТоварМассив.Найти(СтрокаТаблицы.Номенклатура) = Неопределено Тогда
					МаркируемыйТоварМассив.Добавить(СтрокаТаблицы.Номенклатура); 
				КонецЕсли;
			КонецЦикла;
			ТекстСообщения = СтрШаблон("В документе содержится маркируемый товар: %1. Документ подписывается только по ЭДО!", 
										СтрСоединить(МаркируемыйТоварМассив, ", "));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли; 
	КонецЕсли;
	//-- #6602 смарт: Тимофеева 23.04.2026
	#КонецВставки
	
КонецПроцедуры

#КонецОбласти


#Область ДоработкиСмарт

// Фролов+
#Область ПодписьДокумента

&НаСервере
Процедура УстановитьВидимостьПодписиДокумента()
	
	//++ #Б-4672 смарт: Фролов 21.10.2025 //Контроль возврата УПД с подписью клиента
	Элементы.смартГруппаПодпиьДокументаТНПодписан.Видимость = ?(ЭтаФорма.смартПодписанаТН = Неопределено, Ложь, ЭтаФорма.смартПодписанаТН);
	
	Элементы.ГруппаПодписьДокументаДоп.Видимость = смартПодписан;
	//ЭтаФорма.ТолькоПросмотр = смартПодписан И Не РольДоступна("ПолныеПрава");
	ЭтаФорма.ТолькоПросмотр = (смартПодписан ИЛИ ЭтаФорма.смартПодписанаТН) И Не РольДоступна("ПолныеПрава");
	//-- #Б-4672 смарт: Фролов 21.10.2025
	
КонецПроцедуры	

&НаКлиенте
Процедура смартСкопировать(Команда)
	DOM=Элементы.смартБФ.Документ.DefaultView.document;
	textArea=DOM.createElement("textarea");
	textArea.value=смартИмяФайла;
	DOM.body.appendChild(textArea);
	textArea.focus();
	textArea.select();
	DOM.execCommand("copy");
	DOM.body.removeChild(textArea);
КонецПроцедуры

//++ смарт:ММ #066 336 02.09.2020 - Доработка изменения поля "Документ подписан" в Реализации
&НаКлиенте
Процедура смарт_смартОтветственныйЗаПодписьПриИзмененииПосле(Элемент)
	
	Если смартПодписан Тогда
		смартСервер.УстановитьПодписавшегоДокумент(Объект.Ссылка, смартПодписан, смартОтветственныйЗаПодпись);
	КонецЕсли;
		
КонецПроцедуры //-- смарт:ММ 02.09.2020

&НаКлиенте
Процедура смартПодписьПриИзменении(Элемент)
	
	//++ смарт:ММ #066 336 02.09.2020 - Доработка изменения поля "Документ подписан" в Реализации
	Если НЕ смартПодписан И смартПолучитьТекущегоПользователя() <> смартОтветственныйЗаПодпись Тогда
		Оповещение = Новый ОписаниеОповещения("ВопросПередИзменениемДокументПодписанЗавершение", ЭтотОбъект, );
		ТекстВопроса = НСтр("ru = 'После снятия и установки галочки под другим пользователем, изменится ответственный за подписание. Продолжить?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);	
	Иначе
		смартПодписьПриИзмененииПродолжение();
	КонецЕсли;
	
	// Код перенесен в процедуру смартПодписьПриИзмененииПродолжение()
	
	//-- смарт:ММ 02.09.2020
	
КонецПроцедуры

//++ смарт:ММ #066 336 02.09.2020 - Доработка изменения поля "Документ подписан" в Реализации
&НаКлиенте
Процедура ВопросПередИзменениемДокументПодписанЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда			
		смартПодписьПриИзмененииПродолжение();		
	Иначе
		смартПодписан = Истина;
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 02.09.2020

//++ смарт:ММ #066 336 02.09.2020 - Доработка изменения поля "Документ подписан" в Реализации
&НаКлиенте
//++ #Б-4672 смарт: Фролов 21.10.2025 //Контроль возврата УПД с подписью клиента
//Процедура смартПодписьПриИзмененииПродолжение()
Процедура смартПодписьПриИзмененииПродолжение(ПодписанаТН = Ложь)
	
	//Если смартПодписан Тогда
	Если смартПодписан И НЕ ПодписанаТН Тогда
		
		//Если ПроверитьИПодготовитьДанныеДляКопированияВБуферОбмена() Тогда
		Если ПроверитьИПодготовитьДанныеДляКопированияВБуферОбмена(ПодписанаТН) Тогда 
			
			смартСкопировать(Неопределено);
			
		КонецЕсли;
		
	ИначеЕсли ЭтаФорма.смартПодписанаТН И ПодписанаТН Тогда
		
		Если ПроверитьИПодготовитьДанныеДляКопированияВБуферОбмена(ПодписанаТН) Тогда 
	//-- #Б-4672 смарт: Фролов 21.10.2025	
			
			//++ #Б-4672 смарт: Фролов 21.10.2025 //Контроль возврата УПД с подписью клиента
			смартСкопироватьТН(Неопределено);
			Если ПодписанаТН Тогда
				смартУстановитьСнятьПодписанаТН(Объект.Ссылка, Объект.ЗаказКлиента, ЭтаФорма.смартПодписанаТН);
				смартУстановитьУбратьПодписавшегоДокументТН(Объект.Ссылка, ЭтаФорма.смартПодписанаТН, ЭтаФорма.смартОтветственныйЗаПодписаниеТН);
			КонецЕсли;	
			//-- #Б-4672 смарт: Фролов 21.10.2025
			
		КонецЕсли;
		
	Иначе	
		
		//++ #Б-4672 смарт: Фролов 21.10.2025 //Контроль возврата УПД с подписью клиента 
		Если ПодписанаТН Тогда
			смартУстановитьСнятьПодписанаТН(Объект.Ссылка, Объект.ЗаказКлиента, ЭтаФорма.смартПодписанаТН);
			смартУстановитьУбратьПодписавшегоДокументТН(Объект.Ссылка, ЭтаФорма.смартПодписанаТН, ЭтаФорма.смартОтветственныйЗаПодписаниеТН);
		КонецЕсли;	
		//-- #Б-4672 смарт: Фролов 21.10.2025
		
		СнятьПодписьСДокумента();
		УстановитьВидимостьПодписиДокумента();
		
	КонецЕсли;
	
	//++ #Б-4672 смарт: Фролов 22.10.2025 //Контроль возврата УПД с подписью клиента
	Если ПодписанаТН Тогда
		
		Оповестить("ПодписанаТН", ПодписанаТН, Объект.Ссылка);
		
	Иначе 	
		
		Оповестить("ПодписьДокумента",смартПодписан,Объект.Ссылка);
		
	КонецЕсли;
	//-- #Б-4672 смарт: Фролов 22.10.2025
	
КонецПроцедуры //-- смарт:ММ 02.09.2020

&НаСервере
Процедура СнятьПодписьСДокумента()
	смартСервер.УстановитьДокументПодписан(Объект.Ссылка,Объект.ЗаказКлиента,смартПодписан);
КонецПроцедуры

&НаСервере
//++ #Б-4672 смарт: Фролов 21.10.2025 //Контроль возврата УПД с подписью клиента
//Функция ПроверитьИПодготовитьДанныеДляКопированияВБуферОбмена()
Функция ПроверитьИПодготовитьДанныеДляКопированияВБуферОбмена(ПодписанаТН = Ложь)
//-- #Б-4672 смарт: Фролов 21.10.2025	
	
	ОперацияВыполнена = Ложь;
	
	Если смартСчетФактура = Неопределено Тогда 
		
		смартСчетФактура = УчетНДСРФВызовСервера.СчетФактураВыданныйПоОснованию(Объект.Ссылка, Объект.Организация);
		смартИмяФайла = смартСервер.ПолучитьИмяФайлаДляБуфераОбмена(Объект.ЗаказКлиента, смартСчетФактура);
		
		
	КонецЕсли;
	
	//++ #Б-4672 смарт: Фролов 21.10.2025 //Контроль возврата УПД с подписью клиента
	Если ЭтаФорма.смартИмяФайлаТН = "" Тогда
		
		ЭтаФорма.смартИмяФайлаТН = смартСервер.ПолучитьИмяФайлаТНДляБуфераОбмена(Объект.ЗаказКлиента, смартСчетФактура);
		
	КонецЕсли;
	//-- #Б-4672 смарт: Фролов 21.10.2025
	
	//++ #Б-4672 смарт: Фролов 21.10.2025 //Контроль возврата УПД с подписью клиента
	//++ смарт:ММ #066 336 02.09.2020 - Доработка изменения поля "Документ подписан" в Реализации
	//ДанныеПроверки=смартСервер.ЕстьВозможностьПодписатьДокумент(Объект.Ссылка,Объект.ЗаказКлиента,смартСчетФактура);
	//ДанныеПроверки = смартСервер.ЕстьВозможностьПодписатьДокумент(Объект.Ссылка, Объект.ЗаказКлиента, смартСчетФактура, смартОтветственныйЗаПодпись);
	ДанныеПроверки = смартСервер.ЕстьВозможностьПодписатьДокумент(Объект.Ссылка, Объект.ЗаказКлиента, смартСчетФактура, смартОтветственныйЗаПодпись, ПодписанаТН);
	//-- смарт:ММ 02.09.2020
	//-- #Б-4672 смарт: Фролов 21.10.2025
	
	Если ДанныеПроверки.Результат Тогда
		
		//++ #Б-5916 смарт: Фролов 17.03.2026 //Отметка о получении документов в реализации товаров и услуг. Слетает ответственный
		Если ПодписанаТН Тогда
			
			//++ #Б-4672 смарт: Фролов 21.10.2025 //Контроль возврата УПД с подписью клиента
			ЭтаФорма.смартОтветственныйЗаПодписаниеТН = ДанныеПроверки.ОтветственныйЗаПодпись;
			//-- #Б-4672 смарт: Фролов 21.10.2025
			
		Иначе
		
			смартОтветственныйЗаПодпись = ДанныеПроверки.ОтветственныйЗаПодпись;
			
		КонецЕсли;
		//-- #Б-5916 смарт: Фролов 17.03.2026
		
		ОперацияВыполнена = Истина;
		
	Иначе
		
		Для Каждого Ошибка Из ДанныеПроверки.Ошибки Цикл 
			ОбщегоНазначения.СообщитьПользователю(Ошибка);
		КонецЦикла;
		
		смартПодписан = Ложь;
		ЭтаФорма.смартПодписанаТН = Ложь;
		
	КонецЕсли;
	
	УстановитьВидимостьПодписиДокумента();
	
	Возврат ОперацияВыполнена;
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура ЗаполнитьДоставкуСервер(ПоЗаказу=Ложь)
	Если Не ТипЗнч(Объект.ЗаказКлиента)=Тип("ДокументСсылка.ЗаказКлиента") Тогда 
		Возврат;
	КонецЕсли;	
	РеквизитыДоставки=ДоставкаТоваровКлиентСервер.ПолучитьПустуюСтруктуруРеквизитовДоставки(Объект);
	ЗаполнитьЗначенияСвойств(РеквизитыДоставки,Объект);
	РеквизитыДоставки.Вставить("КонтактноеЛицо",Объект.ЗаказКлиента.КонтактноеЛицо);
	РеквизитыДоставки.Вставить("смартТелефонКонтактногоЛица",Объект.ЗаказКлиента.смартТелефонКонтактногоЛица);
	
	Если ПоЗаказу Тогда 		
		ЗаполнитьЗначенияСвойств(РеквизитыДоставки,Объект.ЗаказКлиента);
		ЗаполнитьЗначенияСвойств(Объект,РеквизитыДоставки,,"СпособДоставки");
		ЭтотОбъект.Модифицированность=Истина;
	КонецЕсли;
	
	ОписаниеРеквизитов = Новый Соответствие;
	//ОписаниеРеквизитов.Вставить("СпособДоставки"					, "Способ доставки");
	ОписаниеРеквизитов.Вставить("ВремяДоставки"						, "Желаемое время доставки");
	ОписаниеРеквизитов.Вставить("АдресДоставки"						, "Адрес доставки");
	ОписаниеРеквизитов.Вставить("ПеревозчикПартнер"					, "Перевозчик");
	ОписаниеРеквизитов.Вставить("АдресДоставкиПеревозчика"			, "Адрес пункта передачи");
	ОписаниеРеквизитов.Вставить("ЗонаДоставки"						, "Зона доставки");
	ОписаниеРеквизитов.Вставить("ДополнительнаяИнформацияПоДоставке", "Дополнительная информация по доставке");
	ОписаниеРеквизитов.Вставить("КонтактноеЛицо", "Контактное лицо");
	ОписаниеРеквизитов.Вставить("смартТелефонКонтактногоЛица", "Телефон контактноего лица");
	
	Если ЗначениеЗаполнено(РеквизитыДоставки.ВремяДоставкиС) И ЗначениеЗаполнено(РеквизитыДоставки.ВремяДоставкиПо) Тогда
		Шаблон = НСтр("ru='с %1 до %2'");
		ПредставлениеВремениДоставки = СтрШаблон(Шаблон,
			Формат(РеквизитыДоставки.ВремяДоставкиС	, "ДФ='HH"":""mm'"),
			Формат(РеквизитыДоставки.ВремяДоставкиПо, "ДФ='HH"":""mm'"));
		РеквизитыДоставки.Вставить("ВремяДоставки", ПредставлениеВремениДоставки);
	ИначеЕсли ЗначениеЗаполнено(РеквизитыДоставки.ВремяДоставкиС) Тогда
		Шаблон = НСтр("ru='после %1'");
		ПредставлениеВремениДоставки = СтрШаблон(Шаблон,
			Формат(РеквизитыДоставки.ВремяДоставкиС	, "ДФ='HH"":""mm'"));
		РеквизитыДоставки.Вставить("ВремяДоставки", ПредставлениеВремениДоставки);
	ИначеЕсли ЗначениеЗаполнено(РеквизитыДоставки.ВремяДоставкиПо) Тогда
		Шаблон = НСтр("ru='до %1'");
		ПредставлениеВремениДоставки = СтрШаблон(Шаблон,
			Формат(РеквизитыДоставки.ВремяДоставкиПо, "ДФ='HH"":""mm'"));
		РеквизитыДоставки.Вставить("ВремяДоставки", ПредставлениеВремениДоставки);
	КонецЕсли;
	
	смартДоставкаСводно="";
	
	Для Каждого РеквизитДоставки Из РеквизитыДоставки  Цикл 
		ПредставлениеРеквизита = ОписаниеРеквизитов[РеквизитДоставки.Ключ]; 
		Если ПредставлениеРеквизита <> Неопределено И ЗначениеЗаполнено(РеквизитДоставки.Значение) Тогда 
			смартДоставкаСводно = смартДоставкаСводно
			+ НСтр("ru='" + ПредставлениеРеквизита + "'") + ": " + РеквизитДоставки.Значение + Символы.ПС; 
		КонецЕсли;
	КонецЦикла;	

	Элементы.смартДоставка.Картинка=?(Объект.АдресДоставки=Объект.ЗаказКлиента.АдресДоставки,Новый Картинка,БиблиотекаКартинок.ВниманиеСерый)
КонецПроцедуры	

&НаКлиенте
Процедура смартПерезаполнитьДоставку(Команда)
	ЗаполнитьДоставкуСервер(Истина);
КонецПроцедуры
// Фролов-

//Заполнение телефона контактного лица
&НаКлиенте
Процедура смартТелефонКонтактногоЛицаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура смартТелефонКонтактногоЛицаОчистка(Элемент, СтандартнаяОбработка)
	ОбновитьТелефоныКонтактногоЛица();
КонецПроцедуры

&НаСервере
Процедура ОбновитьТелефоныКонтактногоЛица()
	//Фролов ++
	Запрос=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                    |	КонтактныеЛицаПартнеровКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
	                    |	КонтактныеЛицаПартнеровКонтактнаяИнформация.Представление КАК Представление
	                    |ИЗ
	                    |	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровКонтактнаяИнформация
	                    |ГДЕ
	                    |	КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка = &Ссылка
	                    |	И КонтактныеЛицаПартнеровКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)");
	Запрос.УстановитьПараметр("Ссылка",Объект.КонтактноеЛицо);
	Элементы.смартТелефонКонтактногоЛица.СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Представление"));
	//Фролов --
КонецПроцедуры	

//Статус доставки на форме
&НаСервере
Функция ПолучитьСтатусДоставки()

	СтруктураПодчиненности = Новый ТаблицаЗначений;
	СтруктураПодчиненности.Колонки.Добавить("Ссылка",,"Документ");
	СтруктураПодчиненности.Колонки.Добавить("Уровень",,"Уровень подчиенности");
	
	Стр = СтруктураПодчиненности.Добавить();
	Стр.Ссылка = Объект.Ссылка;
	Стр.Уровень = 0;
	
	// Получаем все подчиненные документы
	Для Каждого Строка Из СтруктураПодчиненности Цикл
		
		ЗначениеКритерияОтбора = Строка.Получить(0);
		
		Если Строка.Уровень <= 3 Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СвязанныеДокументы.Ссылка
			|ИЗ
			|	КритерийОтбора.СвязанныеДокументы(&ЗначениеКритерияОтбора) КАК СвязанныеДокументы
			|ГДЕ
			|	ТИПЗНАЧЕНИЯ(СвязанныеДокументы.Ссылка) <> ТИП(Документ.ЗаказПоставщику)
			|	И ТИПЗНАЧЕНИЯ(СвязанныеДокументы.Ссылка) <> ТИП(Документ.ЗаказНаПеремещение)
			|	И ТИПЗНАЧЕНИЯ(СвязанныеДокументы.Ссылка) <> ТИП(Документ.ПриобретениеТоваровУслуг)
			|	И ТИПЗНАЧЕНИЯ(СвязанныеДокументы.Ссылка) <> ТИП(Документ.ПриобретениеУслугПрочихАктивов)";
			
			Запрос.УстановитьПараметр("ЗначениеКритерияОтбора", ЗначениеКритерияОтбора);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Стр = СтруктураПодчиненности.Добавить(); 
				Стр.Ссылка = ВыборкаДетальныеЗаписи.Ссылка;
				Стр.Уровень = Строка.Уровень + 1;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Стр Из СтруктураПодчиненности Цикл
		Если Не Стр.Уровень = 0 Тогда      
			Документ = Стр.Получить(0);
			Если Документ.Проведен И ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.ЗаданиеНаПеревозку") Тогда
				ДокументОбъект = Документ.ПолучитьОбъект();
				Попытка // Получить статус доставки
					ДанныеЗаявкиНаДоставку = Новый Структура(); 
					ДанныеЗаявкиНаДоставку.Вставить("Статус", ДокументОбъект.Статус);
					ДанныеЗаявкиНаДоставку.Вставить("Водитель", ДокументОбъект.Водитель);
					ДанныеЗаявкиНаДоставку.Вставить("ТранспортноеСредство", ДокументОбъект.ТранспортноеСредство);
					ДанныеЗаявкиНаДоставку.Вставить("ДатаДоставки", ДокументОбъект.ДатаВремяРейсаПланС);
					Возврат ДанныеЗаявкиНаДоставку;
				Исключение
					Продолжить;
				КонецПопытки;
			//Иначе
			//	Статус = "Не распределено на доставку"; 
			КонецЕсли;
		//Иначе
		//	Статус = "Не распределено на доставку";
		КонецЕсли;                 
	КонецЦикла;

	Возврат ДанныеЗаявкиНаДоставку;
	
КонецФункции // ПолучитьСтатусДоставки()

&НаКлиенте
Процедура ПереименоватьСтатусыДоставки(Структура)

	Если Не Структура = Неопределено Тогда
		Статус 					= Структура.Статус;
		Водитель 				= Структура.Водитель;
		ТранспортноеСредство 	= Структура.ТранспортноеСредство;
		ДатаДоставки 			= Лев(Строка(Структура.ДатаДоставки), 10);
	Иначе
		Статус = Неопределено;
	КонецЕсли; 
	
	Если Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаданийНаПеревозку.Формируется") Тогда
		ЭтаФорма.Элементы.НадписьСтатусДоставки.Заголовок = "В процессе формирования";
		ЭтаФорма.Элементы.НадписьСтатусДоставки.ЦветТекста = WebЦвета.ТемноОранжевый;
		ЭтаФорма.Элементы.НадписьВодитель.Заголовок = "Водитель не утвержден";
		ЭтаФорма.Элементы.НадписьВодитель.ЦветТекста = WebЦвета.ТемноОранжевый;
		ЭтаФорма.Элементы.НадписьТранспортноеСредство.Заголовок = Строка(ТранспортноеСредство);
		ЭтаФорма.Элементы.НадписьТранспортноеСредство.ЦветТекста = WebЦвета.ТемноОранжевый;
		ЭтаФорма.Элементы.НадписьДатаДоставки.Заголовок = "Дата доставки не утверждена";
		ЭтаФорма.Элементы.НадписьДатаДоставки.ЦветТекста = WebЦвета.ТемноОранжевый;
	ИначеЕсли Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаданийНаПеревозку.КПогрузке") Тогда
		ЭтаФорма.Элементы.НадписьСтатусДоставки.Заголовок = "В процессе погрузки";
		ЭтаФорма.Элементы.НадписьСтатусДоставки.ЦветТекста = WebЦвета.ТемноОранжевый;
		ЭтаФорма.Элементы.НадписьВодитель.Заголовок = Строка(Водитель);
		ЭтаФорма.Элементы.НадписьВодитель.ЦветТекста = WebЦвета.ТемноОранжевый;
		ЭтаФорма.Элементы.НадписьТранспортноеСредство.Заголовок = Строка(ТранспортноеСредство);
		ЭтаФорма.Элементы.НадписьТранспортноеСредство.ЦветТекста = WebЦвета.ТемноОранжевый;
		ЭтаФорма.Элементы.НадписьДатаДоставки.Заголовок = Строка(ДатаДоставки);
		ЭтаФорма.Элементы.НадписьДатаДоставки.ЦветТекста = WebЦвета.ТемноОранжевый;
	ИначеЕсли Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаданийНаПеревозку.Отправлено") Тогда
		ЭтаФорма.Элементы.НадписьСтатусДоставки.Заголовок = "В пути";
		ЭтаФорма.Элементы.НадписьСтатусДоставки.ЦветТекста = WebЦвета.Зеленый;
		ЭтаФорма.Элементы.НадписьВодитель.Заголовок = Строка(Водитель);
		ЭтаФорма.Элементы.НадписьВодитель.ЦветТекста = WebЦвета.Зеленый;
		ЭтаФорма.Элементы.НадписьТранспортноеСредство.Заголовок = Строка(ТранспортноеСредство);
		ЭтаФорма.Элементы.НадписьТранспортноеСредство.ЦветТекста = WebЦвета.Зеленый;
		ЭтаФорма.Элементы.НадписьДатаДоставки.Заголовок = Строка(ДатаДоставки);
		ЭтаФорма.Элементы.НадписьДатаДоставки.ЦветТекста = WebЦвета.Зеленый;
	ИначеЕсли Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаданийНаПеревозку.Закрыто") Тогда
		ЭтаФорма.Элементы.НадписьСтатусДоставки.Заголовок = "Доставлен";
		ЭтаФорма.Элементы.НадписьСтатусДоставки.ЦветТекста = WebЦвета.Зеленый;
		ЭтаФорма.Элементы.НадписьВодитель.Заголовок = Строка(Водитель);
		ЭтаФорма.Элементы.НадписьВодитель.ЦветТекста = WebЦвета.Зеленый;
		ЭтаФорма.Элементы.НадписьТранспортноеСредство.Заголовок = Строка(ТранспортноеСредство);
		ЭтаФорма.Элементы.НадписьТранспортноеСредство.ЦветТекста = WebЦвета.Зеленый;
		ЭтаФорма.Элементы.НадписьДатаДоставки.Заголовок = Строка(ДатаДоставки);
		ЭтаФорма.Элементы.НадписьДатаДоставки.ЦветТекста = WebЦвета.Зеленый;
	Иначе
		ЭтаФорма.Элементы.НадписьСтатусДоставки.Заголовок = "Не поступило в доставку";
		ЭтаФорма.Элементы.НадписьСтатусДоставки.ЦветТекста = WebЦвета.ОранжевоКрасный;
		ЭтаФорма.Элементы.НадписьВодитель.Видимость = Ложь;
		ЭтаФорма.Элементы.НадписьТранспортноеСредство.Видимость = Ложь;
		ЭтаФорма.Элементы.НадписьДатаДоставки.Видимость = Ложь;
	КонецЕсли; 

	ЗапретРедактированияДоставкиВРаботе(Статус);
	
КонецПроцедуры // ПереименоватьСтатусыДоставки()

&НаКлиенте
Процедура ЗапретРедактированияДоставкиВРаботе(Статус)

	ЭтаФорма.Элементы.СтраницыДоставки.ТолькоПросмотр = ?(Статус = Неопределено, Ложь, Истина);
	ЭтаФорма.Элементы.ДатаДоставки.ТолькоПросмотр = ?(Статус = Неопределено, Ложь, Истина);
	ЭтаФорма.Элементы.ПропускнаяСистема.ТолькоПросмотр = ?(Статус = Неопределено, Ложь, Истина);
	Если Не ДоступноНаличиеСчетаВБухгалтерии() Тогда
		ЭтаФорма.Элементы.НаличиеСчетаВБухгалтерии.ТолькоПросмотр = ?(Статус = Неопределено, Ложь, Истина);
	КонецЕсли;
	ЭтаФорма.Элементы.ДополнительнаяОбработкаГрузаТранспортнойКомпанией.ТолькоПросмотр = ?(Статус = Неопределено, Ложь, Истина);
	ЭтаФорма.Элементы.СпособДоставкиТовара.ТолькоПросмотр = ?(Статус = Неопределено, Ложь, Истина);

КонецПроцедуры // ЗапретРедактированияДоставкиВРаботе() 

&НаСервере
Процедура ОбновитьСведенияПоДоставке()
	//ВладелецАдресовДоставки = "Партнер";
	//ДоставкаТоваров.ЗаполнитьРеквизитыДоставки(Элементы, ВладелецАдресовДоставки, Объект);
	ДоставкаТоваров.ЗаполнитьСпискиВыбораАдресовПолучателяОтправителя(Элементы, Объект);
КонецПроцедуры
//Конец статус доставки на форме

// Проверка прав доступа на установку галочку "Наличие счета в бухгалтерии"
//
// Устанавливается после подготовки соправодительных документов
//
// Возвращаемое значение:
//   Булево  
//
&НаСервере
Функция ДоступноНаличиеСчетаВБухгалтерии()
	
	Если Пользователи.РолиДоступны("смартНаличиеСчетаВБухгалтерии,ПолныеПрава") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции // ДоступноНаличиеСчетаВБухгалтерии()

//Проверка заполнения характеристик по строкам товаров

// ЯшниковДА 20180605 +++
&НаКлиенте
Процедура РасшСмарт_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	
	Если Не ТЧТоварыЗаполненаКорректно(Объект.Товары) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшСмарт_ТоварыКоличествоУпаковокПриИзмененииПосле(Элемент)
	
	 Строка = Элементы.Товары.ТекущиеДанные;
	
	Если НоменклатураВРулонахПоХарактеристикам(Строка.Номенклатура) Тогда		
		Если Не ПроверитьПравильностьЗаполненияКоличестваВСтроке(Строка) Тогда 			
			ВывестиСообщениеОбОшибкеПользователю(Строка.НомерСтроки);	
		КонецЕсли;			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ТЧТоварыЗаполненаКорректно(ТчТовары)
	
	ТЧЗаполненаКорректно = Истина;
	
	ТЧТоварыЗаполненаКорректноНаСервере(ТчТовары);
	
	Возврат ТЧЗаполненаКорректно;
	
КонецФункции

&НаСервере
Функция ТЧТоварыЗаполненаКорректноНаСервере(ТчТовары)

	Для Каждого Строка Из ТчТовары Цикл
		Если НоменклатураВРулонахПоХарактеристикам(Строка.Номенклатура) Тогда
			Если Не ПроверитьПравильностьЗаполненияКоличестваВСтроке(Строка) Тогда
				ТЧЗаполненаКорректно = Ложь;
				ВывестиСообщениеОбОшибкеПользователю(Строка.НомерСтроки);				
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;

	Возврат ТЧЗаполненаКорректно;
	
КонецФункции // ()
 
&НаСервере
Функция ПроверитьПравильностьЗаполненияКоличестваВСтроке(Строка)
	
	Намотка = СтрокуВЧисло(Строка.Характеристика);
	КоличествоКОтгрузке = Строка.Количество;
		
	Возврат ОтгрузкаВРулонахКратнаНамотке(Намотка, КоличествоКОтгрузке);
	
КонецФункции	

&НаСервере
Функция ОтгрузкаВРулонахКратнаНамотке(Намотка, КоличествоКОтгрузке)
	
	Возврат (КоличествоКОтгрузке%Намотка) = 0;
	
КонецФункции

&НаСервере
Функция НоменклатураВРулонахПоХарактеристикам(Номенклатура)

	Возврат Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("ТоварРулоныХарактеристики", Истина)

КонецФункции // НоменклатураВРулонахПоХарактеристикам()

// Превращает строку в число без вызова исключений. Стандартная функция преобразования.
//   Число() строго контролирует отсутствие каких либо символов кроме числовых.
//
&НаСервере
Функция СтрокуВЧисло(ИсходнаяСтрока, ЗначениеПоУмолчанию = 0)
	//СтрокаВЧисло = Новый Соответствие;
	//Для Значение = 0 По 9 Цикл
	//	СтрокаВЧисло.Вставить(Строка(Значение), Значение);
	//КонецЦикла;
	//
	//Результат = 0;
	//Для Индекс = 1 По СтрДлина(ИсходнаяСтрока) Цикл
	//	ПоследнийРазряд = СтрокаВЧисло.Получить(Сред(ИсходнаяСтрока, Индекс, 1));
	//	Если ПоследнийРазряд <> Неопределено Тогда
	//		Результат = Результат * 10 + ПоследнийРазряд;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Возврат ?(Результат = 0, ЗначениеПоУмолчанию, Результат);
	
	Возврат Число(ИсходнаяСтрока.Наименование);

КонецФункции

&НаСервере
Процедура ВывестиСообщениеОбОшибкеПользователю(НомерСтроки);
	
	ТекстСообщения = "Строка №" + НомерСтроки + Символы.ПС
								+ "Количество погонных метров должно быть кратно намотке рулона!" + Символы.ПС
								+ "Укажите другое количество погонных метров.";
		
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстСообщения,
				,,,); 
	
КонецПроцедуры
// ЯшниковДА 20180605 +++

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 26.02.2020 14:06:35
&НаСервере
Процедура смартДобавитьКоммандуНаФорму()
	
	  // Создадим команду
    Команда		= ЭтаФорма.Команды.Добавить("смартСдвинутьДату");
    Команда.Действие	= "смартСдвинутьДату";

    // Создадим кнопку и привяжем к ней команду
    Кнопка		= ЭтаФорма.Элементы.Добавить("ВыполнитьСдвинутьДату", Тип("КнопкаФормы"), ЭтаФорма.Элементы.ГруппаНомерДата);
    Кнопка.Заголовок	= "Выполнить сдвиг даты, назад";
	Кнопка.Отображение=ОтображениеКнопки.Картинка;
	Кнопка.Картинка=БиблиотекаКартинок.Назад;
	Кнопка.ИмяКоманды	= "смартСдвинутьДату";
	
КонецПроцедуры

&НаКлиенте
Процедура смартСдвинутьДату()
	смартСдвинутьДатуСервер();	
КонецПроцедуры

&НаСервере
Процедура смартСдвинутьДатуСервер()
	
	//++ #Б-5464 смарт: Фролов 27.01.2026 //Документ РТУ. Изменение даты в документе по кнопке
	//ДатаДок=Объект.Дата;
	//
	//Пока Истина Цикл
	//	ДатаДок=ДатаДок-86400;
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	КалендарныеГрафики.ДеньВключенВГрафик КАК ДеньВключенВГрафик
	//	|ИЗ
	//	|	РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
	//	|ГДЕ
	//	|	КалендарныеГрафики.ДатаГрафика = &ДатаГрафика";
	//	
	//	Запрос.УстановитьПараметр("ДатаГрафика", НачалоДня(ДатаДок));
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	Если РезультатЗапроса.Пустой() тогда
	//		Сообщить("Не заполнен, производственный календарь!");
	//		Возврат;
	//	КонецЕсли;
	//	
	//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//	Если ВыборкаДетальныеЗаписи.Следующий() И ВыборкаДетальныеЗаписи.ДеньВключенВГрафик тогда
	//		Объект.Дата=ДатаДок;
	//		Возврат;
	//	Иначе
	//		Продолжить;
	//	КонецЕсли;
	//КонецЦикла;
	
	Объект.Дата = Объект.Дата - 86400;
	//++ #Б-5464 смарт: Фролов 27.01.2026 //Описание
	
КонецПроцедуры
//Смарт }Подкин Алексей Иванович 26.02.2020 14:06:35

//++ смарт:ММ #066 336 02.09.2020 - Доработка изменения поля "Документ подписан" в Реализации
Функция смартПолучитьТекущегоПользователя()
	Возврат ПараметрыСеанса.ТекущийПользователь;	
КонецФункции //-- смарт:ММ 02.09.2020


//Конец проверки характеристик по строкам товаров

//++ смарт:КМД #2_2 461 23.03.2021
&НаКлиенте
Процедура смарт_ПроверитьПраваСозданиеБезвозмезднойПередачи()
	//если создаем реализация на основании заказа с безвозмезной передачей товара и нет прав, то не даем создать реализацию
	Если Параметры.Ключ.Пустая() тогда
		
		Если Объект.смартБезвозмезднаяПередача = Истина И смарт_ЕстьРоль_смартИспользованиеБезвозмезднойПередачиТоваров() = Ложь тогда
			
			Отказ = Истина;
			ПоказатьПредупреждение(Новый ОписаниеОповещения("смарт_ПроверитьПраваСозданиеБезвозмезднойПередачиЗавершение", ЭтаФорма), "Нет прав на создание безвозмездной передачи! Обратитесь на buh@smart-t.ru");
			
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

//++ смарт:КМД #2_2 461 23.03.2021
&НаКлиенте
Процедура смарт_ПроверитьПраваСозданиеБезвозмезднойПередачиЗавершение(ДополнительныеПараметры) Экспорт
	
	ЭтаФорма.Закрыть();

КонецПроцедуры

//++ смарт:КМД #2_2 461 23.03.2021
&НаСервере
Функция смарт_ЕстьРоль_смартИспользованиеБезвозмезднойПередачиТоваров()
	Возврат Пользователи.РолиДоступны("смартИспользованиеБезвозмезднойПередачиТоваров");
КонецФункции

//Конец проверки характеристик по строкам товаров

&НаКлиенте
//++ #Б-4672 смарт: Фролов 15.10.2025 //Контроль возврата УПД с подписью клиента
Процедура смартСкопироватьТН(Команда)
	
	DOM = Элементы.смартБФ.Документ.DefaultView.document;
	textArea = DOM.createElement("textarea");
	textArea.value = ЭтаФорма.смартИмяФайлаТН;
	DOM.body.appendChild(textArea);
	textArea.focus();
	textArea.select();
	DOM.execCommand("copy");
	DOM.body.removeChild(textArea);
	
КонецПроцедуры //-- #Б-4672 смарт: Фролов 22.10.2025

&НаКлиенте
//++ #Б-4672 смарт: Фролов 21.10.2025 //Контроль возврата УПД с подписью клиента
Процедура смартПодписанаТНПриИзменении(Элемент)
	
	Если НЕ ЭтаФорма.смартПодписанаТН И смартПолучитьТекущегоПользователя() <> ЭтаФорма.смартОтветственныйЗаПодписаниеТН Тогда
		Оповещение = Новый ОписаниеОповещения("смартВопросПередИзменениемДокументПодписанаТНЗавершение", ЭтотОбъект, );
		ТекстВопроса = НСтр("ru = 'После снятия и установки галочки под другим пользователем, изменится ответственный за подписание ТН. Продолжить?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);	
	Иначе
		смартПодписьПриИзмененииПродолжение(Истина);
	КонецЕсли;
	
КонецПроцедуры //-- #Б-4672 смарт: Фролов 22.10.2025

&НаКлиенте 
//++ #Б-4672 смарт: Фролов 21.10.2025 //Контроль возврата УПД с подписью клиента
Процедура смартВопросПередИзменениемДокументПодписанаТНЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда			
		смартПодписьПриИзмененииПродолжение(Истина);		
	Иначе
		ЭтаФорма.смартПодписанаТН = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
//++ #Б-4672 смарт: Фролов 21.10.2025 //Контроль возврата УПД с подписью клиента
Процедура смартУстановитьСнятьПодписанаТН(Реализация, Заказ, ПодписанаТН) 
	
	УстановитьПривилегированныйРежим(Истина); 
	
	МенеджерЗаписи = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = Реализация;
	МенеджерЗаписи.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("ИдентификаторДляФормул", "ПодписанаТН");
	МенеджерЗаписи.Значение = ПодписанаТН;
	
	МенеджерЗаписи.Записать();

	Если ЗначениеЗаполнено(Заказ) Тогда

		РегистрыСведений.СостоянияЗаказовКлиентов.ОтразитьСостояниеЗаказа(Заказ, Ложь);
		
	КонецЕсли; 
	
КонецПроцедуры //-- #Б-4672 смарт: Фролов 22.10.2025

&НаСервере
//++ #Б-4672 смарт: Фролов 22.10.2025 //Контроль возврата УПД с подписью клиента
Процедура смартУстановитьУбратьПодписавшегоДокументТН(Ссылка, ПодписанаТН, Подписавший) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = Ссылка;
	Если НЕ ЗначениеЗаполнено(Подписавший) Тогда
		Подписавший = Пользователи.ТекущийПользователь();
	КонецЕсли;
	МенеджерЗаписи.Значение = ?(ПодписанаТН, Подписавший, Неопределено);
	МенеджерЗаписи.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("ИдентификаторДляФормул", "ОтветственныйЗаПодписаниеТН");
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры //-- #Б-4672 смарт: Фролов 22.10.2025

//++ #Б5372 смарт: Шляпников 20.01.2026 / Доработать механизм контроля подписания УПД
&НаКлиенте
Процедура смартРаботаПоДокументамПроведенаПриИзменении(Элемент)
	
	смартУстановитьСнятьРаботаПоДокументамПроведена(Объект.Ссылка, Объект.ЗаказКлиента, ЭтаФорма.смартРаботаПоДокументамПроведена);
	
КонецПроцедуры

//++ #Б5372 смарт: Шляпников 20.01.2026 / Доработать механизм контроля подписания УПД
&НаСервере
Процедура смартУстановитьСнятьРаботаПоДокументамПроведена(Реализация, Заказ, Значение) 
	
	УстановитьПривилегированныйРежим(Истина); 
	
	МенеджерЗаписи = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = Реализация;
	МенеджерЗаписи.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "смартРаботаПоДокументамПроведена");
	МенеджерЗаписи.Значение = Значение;
	
	МенеджерЗаписи.Записать();

	Если ЗначениеЗаполнено(Заказ) Тогда

		РегистрыСведений.СостоянияЗаказовКлиентов.ОтразитьСостояниеЗаказа(Заказ, Ложь);
		
	КонецЕсли; 
	
КонецПроцедуры

//++ #Б5878 смарт: Шляпников 27.02.2026 / Маркировка радиоэлектронной продукции. Тестирование основного сценария. Выявление ошибок.
&НаСервере
Функция ТекущийПользовательКладовщик()
	
	Возврат РольДоступна("смартДобавлениеИзменениеКодовМаркировкиВДокументеРеализация");
	
КонецФункции

//++ #Б5878 смарт: Шляпников 27.02.2026 / Маркировка радиоэлектронной продукции. Тестирование основного сценария. Выявление ошибок.
&НаКлиенте
Процедура смартПодборШтрихкодовМаркировки(Команда) Экспорт
	
	ТаблицаТоваров = Новый Массив;
	ТаблицаШтрихкодов = Новый Массив;
	
	Для каждого стрТовары Из Объект.Товары Цикл
		ТаблицаТоваров.Добавить(Новый Структура("Номенклатура,Количество", стрТовары.Номенклатура, стрТовары.Количество));
	КонецЦикла;
	
	Для каждого стрШтрихкодУпаковки Из Объект.ШтрихкодыУпаковок Цикл
		ТаблицаШтрихкодов.Добавить(Новый Структура("ШтрихкодУпаковки", стрШтрихкодУпаковки.ШтрихкодУпаковки));
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура("ТаблицаНоменклатуры,ТаблицаШтрихкодов", ТаблицаТоваров, ТаблицаШтрихкодов);
	Если ТекущийПользовательКладовщик() Тогда
		ПараметрыФормы.Вставить("Документ", Объект.Ссылка);
	КонецЕсли;
	
	ОткрытьФорму("Обработка.смартПодборМаркировкиВДокументы.Форма.Форма", ПараметрыФормы, ЭтаФорма,,,, Новый ОписаниеОповещения("смартПодборШтрихкодовМаркировкиЗавершение", ЭтаФорма), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

//++ #Б5878 смарт: Шляпников 27.02.2026 / Маркировка радиоэлектронной продукции. Тестирование основного сценария. Выявление ошибок.
&НаКлиенте
Процедура смартПодборШтрихкодовМаркировкиЗавершение(Значение, ДопПараметры) Экспорт
	
	Если НЕ Значение = Неопределено Тогда
		
		Объект.ШтрихкодыУпаковок.Очистить();
		
		Для каждого стрШтрихкодУпаковки Из Значение Цикл
			
			НоваяСтрока = Объект.ШтрихкодыУпаковок.Добавить();
			НоваяСтрока.ШтрихкодУпаковки = стрШтрихкодУпаковки;
			
		КонецЦикла;
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
	Если ТекущийПользовательКладовщик() Тогда
		Прочитать();
	КонецЕсли;
	
	УстановитьОтметкуОПодобранныхШтрихкодахВДокументе();
	
КонецПроцедуры

//++ #Б5878 смарт: Шляпников 27.02.2026 / Маркировка радиоэлектронной продукции. Тестирование основного сценария. Выявление ошибок.
&НаСервере
Процедура УстановитьОтметкуОПодобранныхШтрихкодахВДокументе()
	
	смартМаркировка.УстановитьОтметкуОПодобранныхШтрихкодахВДокументе(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПослеЗаписи")
Процедура смарт_ПослеЗаписи(ПараметрыЗаписи)

	Оповестить("Запись_РеализацияТоваровУслуг", ПараметрыЗаписи, Объект.Ссылка);

	Если ЗначениеЗаполнено(ИзмененныеРеквизитыТОРГ12Строка) Тогда

		Если СтрНайти(ИзмененныеРеквизитыТОРГ12СтрокаСинонимов, ",") <> 0 Тогда  
			ТекстВопроса = НСтр("ru = 'Реквизиты %ИзмененныеРеквизиты% были изменены. Изменить их значения в транспортных накладных, в которых числится текущий документ?'");
		Иначе
			ТекстВопроса = НСтр("ru = 'Реквизит %ИзмененныеРеквизиты% был изменен. Изменить его значение в транспортных накладных, в которых числится текущий документ?'");
		КонецЕсли;

		ТекстВопроса = СтрЗаменить(ТекстВопроса, "%ИзмененныеРеквизиты%", ИзмененныеРеквизитыТОРГ12СтрокаСинонимов);
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить(КодВозвратаДиалога.ОК, НСтр("ru = 'Изменить'"));
		СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Не изменять'"));
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеЗаписиЗавершение", ЭтотОбъект, Новый Структура("ПараметрыЗаписи", ПараметрыЗаписи)), ТекстВопроса, СписокКнопок);
		Возврат;

	КонецЕсли;

	СобытияФормКлиент.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);

	ОбщегоНазначенияУТКлиент.ВыполнитьДействияПослеЗаписи(ЭтаФорма, Объект, ПараметрыЗаписи);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ОповеститьОбИзмененииТекущихДелПоЭДО();

	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтаФорма, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

	#Вставка
	//++ #Б6778 смарт: Шляпников 04.05.2026 / Маркировка товара. Экспериментальный режим маркировки.
	смартМаркировкаКлиент.ВывестиСообщениеОНаличииТоваровСЭкспериментальнойМаркировкой(Объект);
	//-- #Б6778 смарт: Шляпников 04.05.2026
	
	//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
	ЗаполнитьДанныеОМаркировкеНоменклатуры();
	//-- #Б6794 смарт: Шляпников 07.05.2026
	#КонецВставки
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ТоварыПриИзменении")
Процедура смарт_ТоварыПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные; 

	Если ТекущаяСтрока <> Неопределено Тогда
		ОбновитьОтклоненияОтЗаказаВСтроке(ТекущаяСтрока, Объект.РеализацияПоЗаказам, Объект.ТребуетсяЗалогЗаТару);

		ОбновитьЗависимыеРеквизитыФормыПоЗаказу(
		Объект.Товары,
		НадписьРасхождениеЗаказ,
		Элементы);

	КонецЕсли;

	УстановитьВидимостьРеквизитовОплаты(ЭтаФорма);
	
	#Вставка
	//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
	ЗаполнитьДанныеОМаркировкеНоменклатуры();
	//-- #Б6794 смарт: Шляпников 07.05.2026
	#КонецВставки

КонецПроцедуры

//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
&НаСервере
Процедура ЗаполнитьДанныеОМаркировкеНоменклатуры()
	
	смартМаркировка.ЗаполнитьИнформациюОМаркировкеВТаблицуНоменклатуры(Объект.Товары);
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ОбработкаВыбора")
Процедура смарт_ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)

	Если ИсточникВыбора.ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаПодбораТоваровИзЗаказа" Тогда

		ОбработкаПодбораТоваровИзЗаказа(ВыбранноеЗначение.АдресТоваровВХранилище);

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ПодборТоваровВДокументПродажи.Форма.Форма" Тогда

		ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение);

	ИначеЕсли ИсточникВыбора.ИмяФормы = "ОбщаяФорма.РеквизитыПечатиРеализации" Тогда

		Если ВыбранноеЗначение <> Неопределено Тогда
			Модифицированность = Истина;
			ЗаполнитьЗначенияСвойств(Объект, ВыбранноеЗначение);
		КонецЕсли;

	ИначеЕсли ИсточникВыбора.ИмяФормы = "ОбщаяФорма.РедактированиеВзаиморасчетов" Тогда

		ПолучитьРасшифровкуПлатежаИзХранилища(ВыбранноеЗначение.АдресПлатежейВХранилище);

	ИначеЕсли УчетНДСУПКлиент.ЗаконченоРедактированиеСчетаФактурыВыданного(ВыбранноеЗначение, ИсточникВыбора) Тогда

		ОбновитьТекстСчетаФактурыВыданные();

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ПодборМногооборотнойТары.Форма.Форма" Тогда

		ЗаполнитьМногооборотнуюТаруИзХранилищаСервер(ВыбранноеЗначение.АдресМногооборотнойТарыВХранилище);
		МногооборотнаяТараКлиент.ОповеститьПользователяОЗаполненииМногооборотнойТарой();
		СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.ВидыЗапасов.Форма.ФормаВводаВидовЗапасов" Тогда	

		ПолучитьВидыЗапасовИзХранилища(ВыбранноеЗначение);

	ИначеЕсли НоменклатураКлиент.ЭтоУказаниеСерий(ИсточникВыбора) Тогда

		НоменклатураКлиент.ОбработатьУказаниеСерии(ЭтаФорма, ПараметрыУказанияСерий, ВыбранноеЗначение);

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ЗагрузкаДанныхИзВнешнихФайлов.Форма.Форма" Тогда

		ПолучитьЗагруженныеТоварыИзХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Документ.ТранспортнаяНакладная.Форма.ФормаВыбора" Тогда

		ПараметрыТТН = ПродажиВызовСервера.ПроверитьИспользованиеИДоступТТН();
		ДанныеТранспортныхНакладных = ОбработкаВыбораТранспортнойНакладной(ВыбранноеЗначение);
		ПродажиКлиентСервер.ОбновитьИнформациюТранспортныхНакладных(ЭтаФорма, ДанныеТранспортныхНакладных, ПараметрыТТН);

	КонецЕсли;

	Если Окно <> Неопределено Тогда
		Окно.Активизировать();
	КонецЕсли;

	УстановитьПризнакЗаполненияСклада();

	#Вставка
	//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
	ЗаполнитьДанныеОМаркировкеНоменклатуры();
	//-- #Б6794 смарт: Шляпников 07.05.2026
	#КонецВставки
	
КонецПроцедуры

#КонецОбласти
